In [33]:
!pip3 install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\hugor\anaconda3\lib\site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hugor\anaconda3\lib\site-packages (from sqlalchemy) (1.0.0)

In [34]:
import pandas as pd
matriculas_por_curso = pd.read_csv("matriculas_por_curso.csv")
matriculas = pd.read_csv("matriculas.csv")

In [35]:
from sqlalchemy import create_engine, MetaData, Table, inspect # adicionando o método inspect

engine = create_engine('sqlite:///:memory:')
engine
type(engine)

matriculas_por_curso.to_sql('matriculas', engine)

inspector = inspect(engine) # criando um Inspector object
print(inspector.get_table_names()) # Exibindo as tabelas com o inspecto

['matriculas']

In [36]:
type("matriculas")

str

## Buscando do Banco SQL

In [37]:
query = "select * from matriculas where quantidade_de_alunos < 30"

In [38]:
pd.read_sql(query, engine)

   index  id_curso  quantidade_de_alunos          nome_do_curso
0      0         1                    24  Lógica de programação
1      4         5                     3       Cursos de Python
2     11        12                    21        Hardware básico
3     12        13                    21  Persistência com .NET
4     13        14                    18    Desenvolvendo jogos
5     15        16                    24     Estatística básica
6     18        19                     6  Boas práticas em Java

In [39]:
muitas_matriculas = pd.read_sql_table("matriculas", engine, columns=["nome_do_curso", "quantidade_de_alunos"])

In [40]:
muitas_matriculas = muitas_matriculas.query("quantidade_de_alunos > 200")

In [41]:
muitas_matriculas

Empty DataFrame
Columns: [nome_do_curso, quantidade_de_alunos]
Index: []

## Escrevendo no Banco

In [42]:
muitas_matriculas.to_sql("muitas_matriculas", con=engine)

In [43]:
print(muitas_matriculas)

Empty DataFrame
Columns: [nome_do_curso, quantidade_de_alunos]
Index: []

In [44]:
print(engine.table_names())

['matriculas', 'muitas_matriculas']

<ipython-input-44-7f622051bbf8>:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  print(engine.table_names())

## Nomes dos alunos e alunas da próxima turma

In [45]:
matriculas_por_curso.head()

   id_curso  quantidade_de_alunos          nome_do_curso
0         1                    24  Lógica de programação
1         2                    52          Java para Web
2         3                    54            C# para Web
3         4                    51          Ruby on Rails
4         5                     3       Cursos de Python

In [46]:
matriculas.head()

   id_aluno  id_curso
0       235         8
1        43         6
2       304         7
3       304        18
4       304        11

In [47]:
id_curso = 16

In [48]:
proxima_turma = matriculas.query(f"id_curso == {id_curso}")

In [50]:
proxima_turma.head()

     id_aluno  id_curso
101       296        16
122        27        16
173       246        16
201        96        16
261       285        16

In [51]:
nomes.sample(3)

NameError: name 'nomes' is not defined